update diagram for database
